In [2]:
import pandas as pd
import numpy as np

In [4]:
# pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['column1','column2','column3','column4'])

In [5]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [26]:
df[['column2','column3']]

      column2  column3
Row1        1        2
Row2        5        6
Row3        9       10
Row4       13       14
Row5       17       18

In [7]:
df.to_csv('Test.csv')

In [12]:
# accessing elements
## 1) .loc
## 2) .iloc -  index locations
print(df.loc['Row1'])
print("------------------------------------------------")
print("Type of row is:",type(df.loc['Row1']))

column1    0
column2    1
column3    2
column4    3
Name: Row1, dtype: int32
------------------------------------------------
Type of row is: <class 'pandas.core.series.Series'>

In [13]:
df.iloc[:,:]

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [15]:
df.iloc[:2,:]

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7

In [18]:
df.iloc[1:4,2:4]

      column3  column4
Row2        6        7
Row3       10       11
Row4       14       15

In [19]:
type(df.iloc[1:4,2:4])

pandas.core.frame.DataFrame

In [20]:
# loc gives you series but iloc gives you a pandas datframe

In [21]:
#conver DataFrames into array
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [22]:
df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [24]:
df['column1'].unique()

array([ 0,  4,  8, 12, 16], dtype=int64)